src/Misc/Trade/Trade Overview.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-2.org
#+TITLE: Trade Overview
#+OPTIONS: num:nil H:2


* General
** syque
http://syque.com/index.htm
** QuantNet
 https://www.quantnet.com/
* Quality Tools
http://syque.com/quality_tools/tools/tools.htm
+ Tools for collecting data
+ Tools for analysing numeric data
+ Tools for understanding qualitative data
+ Tools for analysing and designing processes
+ Tools for understanding process performance
+ Tools for understanding cause and effect
+ Tools for identifying solutions
..

* QuantNet Best-selling Books of 2012
https://www.quantnet.com/threads/quantnet-best-selling-books-of-2012.12190/
A Primer for the Mathematics of Financial Engineering, 2nd Ed - Dan Stefanica
Solutions, Primer For The Mathematics Of Financial Engineering, 2nd Ed - Dan Stefanica
Quant Job Interview Questions And Answers– Mark Joshi
Fifty Challenging Problems in Probability with Solutions – Frederick Mosteller
The Complete Guide to Capital Markets for Quantitative Professionals
My Life as a Quant: Reflections on Physics and Finance – Emanuel Derman
Heard on The Street: Quantitative Questions from Wall Street Job Interviews - Timothy Crack
Frequently Asked Questions in Quantitative Finance - Paul Wilmott
A Practical Guide To Quantitative Finance Interviews – Xinfeng Zhou
Liar's Poker - Michael Lewis
Cracking the Coding Interview: 150 Programming Questions and Solutions - Gayle Laakmann McDowell
How I Became a Quant: Insights from 25 of Wall Street's Elite - Richard R. Lindsey
Problem Solving with C++, 8th Edition - Walter Savitch
Options, Futures and Other Derivatives (8th Edition) - John Hull
Stochastic Calculus for Finance I: The Binomial Asset Pricing Model - Steven Shreve
Paul Wilmott on Quantitative Finance 3 Volume Set (2nd Edition) - Paul Wilmott
Stochastic Calculus for Finance II: Continuous-Time Models - Steven Shreve
Principles of Financial Engineering, 2nd Edition - Salih Neftci
C++ Design Patterns and Derivatives Pricing - Mark Joshi
C++ Primer Plus - Stephen Prata
The Big Short: Inside the Doomsday Machine - Michael Lewis
When Genius Failed: The Rise and Fall of Long-Term Capital Management - Roger Lowenstein
Starting Your Career as a Wall Street Quant - Brett Jiu
Reminiscences of a Stock Operator - Edwin Lefevre
The Quants: How a New Breed of Math Whizzes Conquered Wall Street and Nearly Destroyed It - Scott Patterson

* Quant
+ http://www.wonabru.com/index_files/Page572.html


* More Resource [fn:1]
** Archive of Papers
Behavioral Finance http://behaviouralfinance.net/ 

** Forums and Public Resources 
Tradery http://www.tradery.com/ 
JavaTraders http://groups.google.com/group/JavaTraders 
InteractiveBrokers.API.Discussion.Forum http://finance.groups.yahoo.com/group/TWSAPI/ 

** Platforms 
**** Commercial 
MetaTrader http://www.metaquotes.net/ 
RealTick http://www.realtick.com/ 
TradeStation http://www.tradestation.co.uk/ 
WealthLab http://www.wealth-lab.com/Home/Default.aspx 
NinjaTrader http://www.ninjatrader.com/webnew/index.htm 
SmartQuant http://www.smartquant.com/ 

**** Open Source / Free 
ActiveQuant http://www.activestocks.de/ 
EclipseTrader http://www.eclipsetrader.org/ 
AIOTrade http://blogtrader.net/page/dcaoyuan/category/AIOTrade 
Merchant of Venice http://mov.sourceforge.net/ 
Open Java Trading System http://ojts.sourceforge.net/ 
TrueTrade http://code.google.com/p/truetrade/ 
Artificial Stock Market http://artstkmkt.sourceforge.net/ 
iTrade http://itrade.sourceforge.net/ 
Matlab Automated Trading Toolbox http://sourceforge.net/projects/mlmechtrade 
NexTick http://nextick.sourceforge.net/ 
Robotrader http://sourceforge.net/projects/robotrader/ 
TickZOOM http://www.tickzoom.org 
Marketcetera http://www.marketcetera.com/ 

** DataFeeds 
NxCore http://www.nanex.net/ 
IQFeed http://www.iqfeed.net/ 
ESignal http://www.esignal.com/ 

** Brokerage API 
InteractiveBrokers TWS http://www.interactivebrokers.com/e...i&amp;ib_entity=llc 
Genesis Securities http://www.gndt.com/automated/download.htm 
Trading Technologies http://www.tradingtechnologies.com/ (http://devnet.tradingtechnologies.c...ductCenter.aspx) 
FIXopaedia http://b2bits.com/fixopaedia/index.html 
Assent Anvil http://www.assent.com/api.php 

** Software 
R http://www.r-project.org/ 
Octave http://www.gnu.org/software/octave/ 
Gretl http://gretl.sourceforge.net/ 
Sage http://www.sagemath.org/index.html 
Data Visualizer http://dataviews.sourceforge.net/ 
Market Analysis System http://eiffel-mas.sourceforge.net/ 
Matrex http://matrex.sourceforge.net/ 
Scilab http://www.scilab.org/ 
jMATLAB http://www.jmatlab.org/index.html 

** Historic Data 
Historic Futures Data http://www.anfutures.com/data_es.htm 
Historic Commitment of Traders http://www.cftc.gov/marketreports/c...historical.html 
Historic Forex Data http://disktrading.is99.com/disktrading/ 
Historical Tick Data http://www.tickdata.com/ 

Strategy Discussion 
Pairs Trading http://yats.com/doc/cointegration-en.html 

** Software Libraries & Source Code 

*** C/C++ 
QuantLib http://quantlib.org/index.shtml 
TALib http://ta-lib.org/index.html 
GECODE http://www.gecode.org/index.html 
Tokyo Cabinet http://tokyocabinet.sourceforge.net/spex-en.html 
libmemcached http://tangent.org/552/libmemcached.html 
TinyXML++ http://ticpp.googlecode.com/svn/docs/ticpp.html 
QuickFIX http://www.quickfixengine.org/ 
OpenMP http://openmp.org/wp/ 
Gzstream http://www.cs.unc.edu/Research/compgeom/gzstream/ 
libevent http://monkey.org/~provos/libevent/doxygen/ 
qtstalker http://sourceforge.net/projects/qtstalker/ 
Qt Concurrent http://labs.trolltech.com/page/Proj...ds/QtConcurrent 
The Phoenix System http://csl.stanford.edu/~christos/sw/phoenix/ 


*** Ruby 
EventMachine http://rubyeventmachine.com/ 
memcached http://www.deveiate.org/code/Ruby-MemCache/ 
Ruby to Erlang http://rubyforge.org/projects/erlectricity/ 
SkyNet http://skynet.rubyforge.org/ 

**** Python 
Twisted http://twistedmatrix.com/trac/ 
Processing http://pypi.python.org/pypi/processing 
Stackless http://www.stackless.com/ 
twill http://twill.idyll.org/python-api.html 
disco http://discoproject.org/ 

**** C# 
mono http://www.mono-project.com/ 
Interactive Brokers C# API http://www.dinosaurtech.com/utilities/ 
QLNet http://www.qlnet.org/ 
ScienceCode http://www.sciencecode.com/ 
RabbitMQ http://www.rabbitmq.com/ 
ZedGraph http://www.zedgraph.org 

**** Java 
Javolution http://javolution.org/ 
RabbitMQ http://www.rabbitmq.com/ 
Java Genetic Algorithms Package http://jgap.sourceforge.net/ 
Java Object Oriented Neural Engine http://www.jooneworld.com/ 
JFree (Charting) http://www.jfree.org/ 
JDOM (XML) http://www.jdom.org/ 
hadoop http://hadoop.apache.org/ 
ObjectPool http://commons.apache.org/pool/ 
Commons-Math http://commons.apache.org/math/ 
Java Caching System http://jakarta.apache.org/jcs/index.html 
EHCache http://ehcache.sourceforge.net/ 
SMACK API for Jabber http://www.igniterealtime.org/projects/smack/index.jsp 
MINA http://mina.apache.org/ 
JBoss Netty 3 http://www.jboss.org/netty 
QuickFix/J http://www.quickfixj.org/ 

*** Matlab 
Free Packages http://newsgroups.derkeiler.com/Arc...0/msg00013.html 
Matlab Toolboxes http://stommel.tamu.edu/~baum/toolboxes.html 

*** Other 
Indicator Formulas http://trader.online.pl/ 
Indicator Formulas http://tadoc.org/ 
* SRC
** quantlib
http://quantlib.org/index.shtml
** algoquant
http://numericalmethod.com/blog/algoquant/

https://www.numericalmethod.com:444/svn/algoquant/trunk

* Footnotes

[fn:1] http://www.douban.com/group/topic/47746743/

