public_html/Misc/Trade/Trade Overview.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Trade Overview</title>
<!-- 2014-03-10 Mon 23:05 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Trade Overview</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">General</a>
<ul>
<li><a href="#sec-1-1">syque</a></li>
<li><a href="#sec-1-2">QuantNet</a></li>
</ul>
</li>
<li><a href="#sec-2">Quality Tools</a></li>
<li><a href="#sec-3">QuantNet Best-selling Books of 2012</a></li>
<li><a href="#sec-4">Quant</a></li>
<li><a href="#sec-5">More Resource </a>
<ul>
<li><a href="#sec-5-1">Archive of Papers</a></li>
<li><a href="#sec-5-2">Forums and Public Resources</a></li>
<li><a href="#sec-5-3">Platforms</a></li>
<li><a href="#sec-5-4">DataFeeds</a></li>
<li><a href="#sec-5-5">Brokerage API</a></li>
<li><a href="#sec-5-6">Software</a></li>
<li><a href="#sec-5-7">Historic Data</a></li>
<li><a href="#sec-5-8">Software Libraries &amp; Source Code</a></li>
</ul>
</li>
<li><a href="#sec-6">SRC</a>
<ul>
<li><a href="#sec-6-1">quantlib</a></li>
<li><a href="#sec-6-2">algoquant</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">General</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">syque</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="http://syque.com/index.htm">http://syque.com/index.htm</a>
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">QuantNet</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<a href="https://www.quantnet.com/">https://www.quantnet.com/</a>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Quality Tools</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="http://syque.com/quality_tools/tools/tools.htm">http://syque.com/quality_tools/tools/tools.htm</a>
</p>
<ul class="org-ul">
<li>Tools for collecting data
</li>
<li>Tools for analysing numeric data
</li>
<li>Tools for understanding qualitative data
</li>
<li>Tools for analysing and designing processes
</li>
<li>Tools for understanding process performance
</li>
<li>Tools for understanding cause and effect
</li>
<li>Tools for identifying solutions
</li>
</ul>
<p>
..
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">QuantNet Best-selling Books of 2012</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="https://www.quantnet.com/threads/quantnet-best-selling-books-of-2012.12190/">https://www.quantnet.com/threads/quantnet-best-selling-books-of-2012.12190/</a>
A Primer for the Mathematics of Financial Engineering, 2nd Ed - Dan Stefanica
Solutions, Primer For The Mathematics Of Financial Engineering, 2nd Ed - Dan Stefanica
Quant Job Interview Questions And Answers– Mark Joshi
Fifty Challenging Problems in Probability with Solutions – Frederick Mosteller
The Complete Guide to Capital Markets for Quantitative Professionals
My Life as a Quant: Reflections on Physics and Finance – Emanuel Derman
Heard on The Street: Quantitative Questions from Wall Street Job Interviews - Timothy Crack
Frequently Asked Questions in Quantitative Finance - Paul Wilmott
A Practical Guide To Quantitative Finance Interviews – Xinfeng Zhou
Liar's Poker - Michael Lewis
Cracking the Coding Interview: 150 Programming Questions and Solutions - Gayle Laakmann McDowell
How I Became a Quant: Insights from 25 of Wall Street's Elite - Richard R. Lindsey
Problem Solving with C++, 8th Edition - Walter Savitch
Options, Futures and Other Derivatives (8th Edition) - John Hull
Stochastic Calculus for Finance I: The Binomial Asset Pricing Model - Steven Shreve
Paul Wilmott on Quantitative Finance 3 Volume Set (2nd Edition) - Paul Wilmott
Stochastic Calculus for Finance II: Continuous-Time Models - Steven Shreve
Principles of Financial Engineering, 2nd Edition - Salih Neftci
C++ Design Patterns and Derivatives Pricing - Mark Joshi
C++ Primer Plus - Stephen Prata
The Big Short: Inside the Doomsday Machine - Michael Lewis
When Genius Failed: The Rise and Fall of Long-Term Capital Management - Roger Lowenstein
Starting Your Career as a Wall Street Quant - Brett Jiu
Reminiscences of a Stock Operator - Edwin Lefevre
The Quants: How a New Breed of Math Whizzes Conquered Wall Street and Nearly Destroyed It - Scott Patterson
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Quant</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="http://www.wonabru.com/index_files/Page572.html">http://www.wonabru.com/index_files/Page572.html</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">More Resource <sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup></h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">Archive of Papers</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Behavioral Finance <a href="http://behaviouralfinance.net/">http://behaviouralfinance.net/</a> 
</p>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">Forums and Public Resources</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Tradery <a href="http://www.tradery.com/">http://www.tradery.com/</a> 
JavaTraders <a href="http://groups.google.com/group/JavaTraders">http://groups.google.com/group/JavaTraders</a> 
InteractiveBrokers.API.Discussion.Forum <a href="http://finance.groups.yahoo.com/group/TWSAPI/">http://finance.groups.yahoo.com/group/TWSAPI/</a> 
</p>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3">Platforms</h3>
<div class="outline-text-3" id="text-5-3">
</div><ul class="org-ul"><li>Commercial<br  /><div class="outline-text-5" id="text-5-3-0-1">
<p>
MetaTrader <a href="http://www.metaquotes.net/">http://www.metaquotes.net/</a> 
RealTick <a href="http://www.realtick.com/">http://www.realtick.com/</a> 
TradeStation <a href="http://www.tradestation.co.uk/">http://www.tradestation.co.uk/</a> 
WealthLab <a href="http://www.wealth-lab.com/Home/Default.aspx">http://www.wealth-lab.com/Home/Default.aspx</a> 
NinjaTrader <a href="http://www.ninjatrader.com/webnew/index.htm">http://www.ninjatrader.com/webnew/index.htm</a> 
SmartQuant <a href="http://www.smartquant.com/">http://www.smartquant.com/</a> 
</p>
</div>
</li>
<li>Open Source / Free<br  /><div class="outline-text-5" id="text-5-3-0-2">
<p>
ActiveQuant <a href="http://www.activestocks.de/">http://www.activestocks.de/</a> 
EclipseTrader <a href="http://www.eclipsetrader.org/">http://www.eclipsetrader.org/</a> 
AIOTrade <a href="http://blogtrader.net/page/dcaoyuan/category/AIOTrade">http://blogtrader.net/page/dcaoyuan/category/AIOTrade</a> 
Merchant of Venice <a href="http://mov.sourceforge.net/">http://mov.sourceforge.net/</a> 
Open Java Trading System <a href="http://ojts.sourceforge.net/">http://ojts.sourceforge.net/</a> 
TrueTrade <a href="http://code.google.com/p/truetrade/">http://code.google.com/p/truetrade/</a> 
Artificial Stock Market <a href="http://artstkmkt.sourceforge.net/">http://artstkmkt.sourceforge.net/</a> 
iTrade <a href="http://itrade.sourceforge.net/">http://itrade.sourceforge.net/</a> 
Matlab Automated Trading Toolbox <a href="http://sourceforge.net/projects/mlmechtrade">http://sourceforge.net/projects/mlmechtrade</a> 
NexTick <a href="http://nextick.sourceforge.net/">http://nextick.sourceforge.net/</a> 
Robotrader <a href="http://sourceforge.net/projects/robotrader/">http://sourceforge.net/projects/robotrader/</a> 
TickZOOM <a href="http://www.tickzoom.org">http://www.tickzoom.org</a> 
Marketcetera <a href="http://www.marketcetera.com/">http://www.marketcetera.com/</a> 
</p>
</div>
</li></ul>
</div>
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4">DataFeeds</h3>
<div class="outline-text-3" id="text-5-4">
<p>
NxCore <a href="http://www.nanex.net/">http://www.nanex.net/</a> 
IQFeed <a href="http://www.iqfeed.net/">http://www.iqfeed.net/</a> 
ESignal <a href="http://www.esignal.com/">http://www.esignal.com/</a> 
</p>
</div>
</div>
<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5">Brokerage API</h3>
<div class="outline-text-3" id="text-5-5">
<p>
InteractiveBrokers TWS <a href="http://www.interactivebrokers.com/e...i&amp;ib_entity=llc">http://www.interactivebrokers.com/e...i&amp;ib_entity=llc</a> 
Genesis Securities <a href="http://www.gndt.com/automated/download.htm">http://www.gndt.com/automated/download.htm</a> 
Trading Technologies <a href="http://www.tradingtechnologies.com/">http://www.tradingtechnologies.com/</a> (<a href="http://devnet.tradingtechnologies.c...ductCenter.aspx">http://devnet.tradingtechnologies.c...ductCenter.aspx</a>) 
FIXopaedia <a href="http://b2bits.com/fixopaedia/index.html">http://b2bits.com/fixopaedia/index.html</a> 
Assent Anvil <a href="http://www.assent.com/api.php">http://www.assent.com/api.php</a> 
</p>
</div>
</div>
<div id="outline-container-sec-5-6" class="outline-3">
<h3 id="sec-5-6">Software</h3>
<div class="outline-text-3" id="text-5-6">
<p>
R <a href="http://www.r-project.org/">http://www.r-project.org/</a> 
Octave <a href="http://www.gnu.org/software/octave/">http://www.gnu.org/software/octave/</a> 
Gretl <a href="http://gretl.sourceforge.net/">http://gretl.sourceforge.net/</a> 
Sage <a href="http://www.sagemath.org/index.html">http://www.sagemath.org/index.html</a> 
Data Visualizer <a href="http://dataviews.sourceforge.net/">http://dataviews.sourceforge.net/</a> 
Market Analysis System <a href="http://eiffel-mas.sourceforge.net/">http://eiffel-mas.sourceforge.net/</a> 
Matrex <a href="http://matrex.sourceforge.net/">http://matrex.sourceforge.net/</a> 
Scilab <a href="http://www.scilab.org/">http://www.scilab.org/</a> 
jMATLAB <a href="http://www.jmatlab.org/index.html">http://www.jmatlab.org/index.html</a> 
</p>
</div>
</div>
<div id="outline-container-sec-5-7" class="outline-3">
<h3 id="sec-5-7">Historic Data</h3>
<div class="outline-text-3" id="text-5-7">
<p>
Historic Futures Data <a href="http://www.anfutures.com/data_es.htm">http://www.anfutures.com/data_es.htm</a> 
Historic Commitment of Traders <a href="http://www.cftc.gov/marketreports/c...historical.html">http://www.cftc.gov/marketreports/c...historical.html</a> 
Historic Forex Data <a href="http://disktrading.is99.com/disktrading/">http://disktrading.is99.com/disktrading/</a> 
Historical Tick Data <a href="http://www.tickdata.com/">http://www.tickdata.com/</a> 
</p>

<p>
Strategy Discussion 
Pairs Trading <a href="http://yats.com/doc/cointegration-en.html">http://yats.com/doc/cointegration-en.html</a> 
</p>
</div>
</div>
<div id="outline-container-sec-5-8" class="outline-3">
<h3 id="sec-5-8">Software Libraries &amp; Source Code</h3>
<div class="outline-text-3" id="text-5-8">
</div><ul class="org-ul"><li>C/C++<br  /><div class="outline-text-4" id="text-5-8-1">
<p>
QuantLib <a href="http://quantlib.org/index.shtml">http://quantlib.org/index.shtml</a> 
TALib <a href="http://ta-lib.org/index.html">http://ta-lib.org/index.html</a> 
GECODE <a href="http://www.gecode.org/index.html">http://www.gecode.org/index.html</a> 
Tokyo Cabinet <a href="http://tokyocabinet.sourceforge.net/spex-en.html">http://tokyocabinet.sourceforge.net/spex-en.html</a> 
libmemcached <a href="http://tangent.org/552/libmemcached.html">http://tangent.org/552/libmemcached.html</a> 
TinyXML++ <a href="http://ticpp.googlecode.com/svn/docs/ticpp.html">http://ticpp.googlecode.com/svn/docs/ticpp.html</a> 
QuickFIX <a href="http://www.quickfixengine.org/">http://www.quickfixengine.org/</a> 
OpenMP <a href="http://openmp.org/wp/">http://openmp.org/wp/</a> 
Gzstream <a href="http://www.cs.unc.edu/Research/compgeom/gzstream/">http://www.cs.unc.edu/Research/compgeom/gzstream/</a> 
libevent <a href="http://monkey.org/~provos/libevent/doxygen/">http://monkey.org/~provos/libevent/doxygen/</a> 
qtstalker <a href="http://sourceforge.net/projects/qtstalker/">http://sourceforge.net/projects/qtstalker/</a> 
Qt Concurrent <a href="http://labs.trolltech.com/page/Proj...ds/QtConcurrent">http://labs.trolltech.com/page/Proj...ds/QtConcurrent</a> 
The Phoenix System <a href="http://csl.stanford.edu/~christos/sw/phoenix/">http://csl.stanford.edu/~christos/sw/phoenix/</a> 
</p>
</div>
</li>

<li>Ruby<br  /><div class="outline-text-4" id="text-5-8-2">
<p>
EventMachine <a href="http://rubyeventmachine.com/">http://rubyeventmachine.com/</a> 
memcached <a href="http://www.deveiate.org/code/Ruby-MemCache/">http://www.deveiate.org/code/Ruby-MemCache/</a> 
Ruby to Erlang <a href="http://rubyforge.org/projects/erlectricity/">http://rubyforge.org/projects/erlectricity/</a> 
SkyNet <a href="http://skynet.rubyforge.org/">http://skynet.rubyforge.org/</a> 
</p>
</div>

<ul class="org-ul"><li>Python<br  /><div class="outline-text-5" id="text-5-8-2-1">
<p>
Twisted <a href="http://twistedmatrix.com/trac/">http://twistedmatrix.com/trac/</a> 
Processing <a href="http://pypi.python.org/pypi/processing">http://pypi.python.org/pypi/processing</a> 
Stackless <a href="http://www.stackless.com/">http://www.stackless.com/</a> 
twill <a href="http://twill.idyll.org/python-api.html">http://twill.idyll.org/python-api.html</a> 
disco <a href="http://discoproject.org/">http://discoproject.org/</a> 
</p>
</div>
</li>
<li>C#<br  /><div class="outline-text-5" id="text-5-8-2-2">
<p>
mono <a href="http://www.mono-project.com/">http://www.mono-project.com/</a> 
Interactive Brokers C# API <a href="http://www.dinosaurtech.com/utilities/">http://www.dinosaurtech.com/utilities/</a> 
QLNet <a href="http://www.qlnet.org/">http://www.qlnet.org/</a> 
ScienceCode <a href="http://www.sciencecode.com/">http://www.sciencecode.com/</a> 
RabbitMQ <a href="http://www.rabbitmq.com/">http://www.rabbitmq.com/</a> 
ZedGraph <a href="http://www.zedgraph.org">http://www.zedgraph.org</a> 
</p>
</div>
</li>
<li>Java<br  /><div class="outline-text-5" id="text-5-8-2-3">
<p>
Javolution <a href="http://javolution.org/">http://javolution.org/</a> 
RabbitMQ <a href="http://www.rabbitmq.com/">http://www.rabbitmq.com/</a> 
Java Genetic Algorithms Package <a href="http://jgap.sourceforge.net/">http://jgap.sourceforge.net/</a> 
Java Object Oriented Neural Engine <a href="http://www.jooneworld.com/">http://www.jooneworld.com/</a> 
JFree (Charting) <a href="http://www.jfree.org/">http://www.jfree.org/</a> 
JDOM (XML) <a href="http://www.jdom.org/">http://www.jdom.org/</a> 
hadoop <a href="http://hadoop.apache.org/">http://hadoop.apache.org/</a> 
ObjectPool <a href="http://commons.apache.org/pool/">http://commons.apache.org/pool/</a> 
Commons-Math <a href="http://commons.apache.org/math/">http://commons.apache.org/math/</a> 
Java Caching System <a href="http://jakarta.apache.org/jcs/index.html">http://jakarta.apache.org/jcs/index.html</a> 
EHCache <a href="http://ehcache.sourceforge.net/">http://ehcache.sourceforge.net/</a> 
SMACK API for Jabber <a href="http://www.igniterealtime.org/projects/smack/index.jsp">http://www.igniterealtime.org/projects/smack/index.jsp</a> 
MINA <a href="http://mina.apache.org/">http://mina.apache.org/</a> 
JBoss Netty 3 <a href="http://www.jboss.org/netty">http://www.jboss.org/netty</a> 
QuickFix/J <a href="http://www.quickfixj.org/">http://www.quickfixj.org/</a> 
</p>
</div>
</li></ul>
</li>
<li>Matlab<br  /><div class="outline-text-4" id="text-5-8-3">
<p>
Free Packages <a href="http://newsgroups.derkeiler.com/Arc...0/msg00013.html">http://newsgroups.derkeiler.com/Arc...0/msg00013.html</a> 
Matlab Toolboxes <a href="http://stommel.tamu.edu/~baum/toolboxes.html">http://stommel.tamu.edu/~baum/toolboxes.html</a> 
</p>
</div>
</li>
<li>Other<br  /><div class="outline-text-4" id="text-5-8-4">
<p>
Indicator Formulas <a href="http://trader.online.pl/">http://trader.online.pl/</a> 
Indicator Formulas <a href="http://tadoc.org/">http://tadoc.org/</a> 
</p>
</div>
</li></ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">SRC</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1">quantlib</h3>
<div class="outline-text-3" id="text-6-1">
<p>
<a href="http://quantlib.org/index.shtml">http://quantlib.org/index.shtml</a>
</p>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2">algoquant</h3>
<div class="outline-text-3" id="text-6-2">
<p>
<a href="http://numericalmethod.com/blog/algoquant/">http://numericalmethod.com/blog/algoquant/</a>
</p>

<p>
<a href="https://www.numericalmethod.com:444/svn/algoquant/trunk">https://www.numericalmethod.com:444/svn/algoquant/trunk</a>
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
<a href="http://www.douban.com/group/topic/47746743/">http://www.douban.com/group/topic/47746743/</a>
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2014-03-10 Mon 23:05</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.50.1 (<a href="http://orgmode.org">Org</a> mode 8.2.3a)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
